practiceapp/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "That guy"], ["email", "adkjfh"], ["password", "adsfasd"], ["created_at", "2018-10-23 14:56:31.255458"], ["updated_at", "2018-10-23 14:56:31.255458"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save